clc
clear all

disp ('--- Ybus ---')
x=input('Enter the number of nodes: ')
for i=1:1:x
for j=1:1:x

%{
i=j মানে Self Admittance এর জন্য তো 10,11,12,13,1n পর্যন্ত সব যোগ করা
লাগে। এসময় আমরা শুরু গ্রাউন্ডের সাথে এডমিট্যান্স ডেটা নিবো, বাকিসব যোগ
করে মিলায়ে নিবো কারণ এম্নেও 12,13,1n এসবের ইনপুট দিতে হবে 
%}

if(i==j)
a(i,j)=input(strcat('enter admittance Y', int2str(i), int2str(0),' : '));
elseif (i<j)
a(i,j)=input(strcat('enter admittance Y', int2str(i), int2str(j),' : '));
a(j,i)=a(i,j);
end
end
end

%{
এভাবে ইনপুট দিলাম। Node 3টা , এরপর সিরিয়ালি ১ থেকে ৬ দিয়ে দিসি। এখানে 1,1 ;
2,2 ; 3,3 তে যে ভ্যালু আছে তা আসলে শুধুমাত্র অই বাসের সাথে গ্রাউন্ডের। তাই
এখানে বাকি নোডের সাথে যোগ করা এখনো বাকি

ম্যাট্রিক্স টা দেখলে এমন আসা উচিতঃ

     1     2     3
     2     4     5
     3     5     6
%}

%% Y_bus
b=a
c=0;
for i=1:1:x
for j=1:1:x
if(i==j)

% i=j তে যোগের কাজ আছে, তাই নতুন ভ্যারিয়েবল K আনা হইসে counter এর জন্য

for k=1:1:x
c=c+b(i,k)

%{
a(1,1) এ যে ভ্যালুটা আছে সেটা এখন বাকি দুইটার সাথে যোগ হবে মানে Y10 এর সাথে
অবশ্যই এখন Y12, Y13 যোগ করতে হবে। এতাই c দিয়ে করতেসি। 

শুরুতে node 1 এর জন্য c=1 , তারপর c=1+Y12=1+2=3 , তারপর  c=1+Y13=3+3=6 

একইভাবে নোড ২ এর জন্য 2>6>11 আসবে, নোড ৩ এর জন্য 3>(5+3=)8>(8+6=)14 হবে
%}

end
a(i,j)= c
% a(i,j) এর জায়গায় c বসানো হলো 
c=0;
% c কে আবার ওর ডিফল্ট এ গিয়ে রেখে আসলাম 
% এখন Mutual Admittance নিয়ে ডীল করতে হবে, এখানে আসলে কোন কাজ নাই, LoL
% খালি মাইনাস করে দিবো (সূত্র থেকে আসছে এটা, ওখানে এসব মাইনাস করা)
else
a(i,j)= -b(i,j)
end
end
end
Y_bus=a

%{
এমন রেজাল্ট আসা উচিত Y Bus এ 

Y_bus =

     6    -2    -3
    -2    11    -5
    -3    -5    14
%}

%% Z_bus
Z_bus=inv(Y_bus)

%{
 Y Bus এর ইনভার্স করসে জাস্ট, এমন আসা উচিত ঃ

Z_bus =

    0.2308    0.0769    0.0769
    0.0769    0.1342    0.0644
    0.0769    0.0644    0.1109

%}

%% node elimination
%{
Here comes the real deal. এখানে Node 3 বাদ দিবো
তাই Y bus থেকে রো-কলামকে K,L,M অনুসারে সাজায়ে নিতে হবে (K,L,M হলো সূত্রের, 
স্যার ক্লাসে ব্রেকডাউন দেখাইসে 
আমি নীচে করে দিচ্ছিঃ

------------------
  k      |  L     
         |        
 -----------------
  L(t)   |  M     
         |        
------------------
%}

K=Y_bus(1:2,1:2);
L=Y_bus(1:2,3);
M=Y_bus(3,3);

Y_busnew=K-L*inv(M)*(L.') %সূত্র

%% Current Voltage
I=[-1.2i;-.72-.96i;0]
v=Z_bus*I
